app/controllers/students_controller.rb

  def show
    @Student = Student.find(2)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]